Solartraveler/UniversalboxArm/src/stm32l452/02-test-everything-hal/testEverything.c
	//HSE on
	printf("\r\nStarting external high speed crystal\r\n");
	RCC_OscInitStruct.OscillatorType = RCC_OSCILLATORTYPE_HSE;
	RCC_OscInitStruct.HSEState = RCC_HSE_ON;
	RCC_OscInitStruct.PLL.PLLState = RCC_PLL_NONE;
	HAL_StatusTypeDef result = HAL_RCC_OscConfig(&RCC_OscInitStruct);
	if (result != HAL_OK) {
		printf("Error, returned %u\r\n", (unsigned int)result);
		return;
	}
	printf("Switching to external crystal\r\n");
	Rs232Flush();
	//switch clock source
	RCC_ClkInitStruct.ClockType = RCC_CLOCKTYPE_HCLK | RCC_CLOCKTYPE_SYSCLK
	                             | RCC_CLOCKTYPE_PCLK1 | RCC_CLOCKTYPE_PCLK2;
	RCC_ClkInitStruct.SYSCLKSource = RCC_SYSCLKSOURCE_HSE;
	//HSI is 16MHz, HSE is 8MHz, so peripheral clocks stays the same with div1
	RCC_ClkInitStruct.AHBCLKDivider = RCC_SYSCLK_DIV1;
	RCC_ClkInitStruct.APB1CLKDivider = RCC_HCLK_DIV1;
	RCC_ClkInitStruct.APB2CLKDivider = RCC_HCLK_DIV1;
	result = HAL_RCC_ClockConfig(&RCC_ClkInitStruct, FLASH_LATENCY_0);
	if (result != HAL_OK) {
		printf("Error, returned %u\r\n", (unsigned int)result);
		return;
	}
	g_usingHsi = false;
	SystemCoreClockUpdate();
	if (HAL_RCC_ClockConfig(&RCC_ClkInitStruct, FLASH_LATENCY_0) != HAL_OK) {
		return;
	}
	printf("Running with HSE clock source\r\n");
	//stop the other clocks
	RCC_OscInitStruct.OscillatorType = RCC_OSCILLATORTYPE_HSI | RCC_OSCILLATORTYPE_MSI;
	RCC_OscInitStruct.HSIState = RCC_HSI_OFF;
	RCC_OscInitStruct.MSIState = RCC_MSI_OFF;
	RCC_OscInitStruct.PLL.PLLState = RCC_PLL_NONE;
	HAL_RCC_OscConfig(&RCC_OscInitStruct);
	printf("MSI and HSI turned off\r\n");
}

void CheckHseCrystal(void) {
	if (g_usingHsi == false) {
		printf("\r\nAlready running on external crystal. Switching back.\r\n");
		ClockToHsi();
		printf("Back running on HSI\r\n");
		return;
	}
	ClockToHse();
}

void ClockWithPll(uint32_t frequency, uint32_t apbDivider) {
	ClockToHsi();
	Rs232Flush();
	uint8_t result = McuClockToHsiPll(frequency, apbDivider);
	if (result == 1) {
		printf("Error, unsupported frequency\r\n");
	}
	if (result == 2) {
		printf("Error, failed to set flash latency\r\n");
	}
	if (result == 3) {
		printf("Error, failed to start PLL\r\n");
	}
	if (result == 4) {
		printf("Error, failed to set divider or latency\r\n");
	}
}

//debug prints may not work after changing. As the prescalers are not recalculated
bool ClockToMsi(uint32_t frequency) {
	RCC_OscInitTypeDef RCC_OscInitStruct = {0};
	Rs232Flush();
	if (McuClockToMsi(frequency, RCC_HCLK_DIV1) == false) {
		printf("Error, no MSI\r\n");
		return false;
	}
	RCC_OscInitStruct.OscillatorType = RCC_OSCILLATORTYPE_HSE | RCC_OSCILLATORTYPE_HSI;
	RCC_OscInitStruct.HSEState = RCC_HSE_OFF;
	RCC_OscInitStruct.HSIState = RCC_HSI_OFF;
	HAL_RCC_OscConfig(&RCC_OscInitStruct);
	g_usingHsi = false;
	return true;
}

bool g_highSpeed;

void Speed32M(void) {
	if (!g_highSpeed) {
		printf("\r\nSwitching to 32MHz...\r\n");
		ClockWithPll(32000000, RCC_HCLK_DIV4);
		printf("Now running with 32MHz\r\n");
		g_highSpeed = true;
	} else {
		ClockToHsi();
		RCC_OscInitTypeDef RCC_OscInitStruct = {0};
		RCC_OscInitStruct.PLL.PLLState = RCC_PLL_OFF;
		HAL_RCC_OscConfig(&RCC_OscInitStruct);
		printf("\r\nBack running with 16MHz\r\n");
		g_highSpeed = false;
	}
}

void Speed64M(void) {
	if (!g_highSpeed) {
		printf("\r\nSwitching to 64MHz...\r\n");
		ClockWithPll(64000000, RCC_HCLK_DIV8);
		printf("Now running with 64MHz\r\n");
		g_highSpeed = true;
	} else {
		ClockToHsi();
		RCC_OscInitTypeDef RCC_OscInitStruct = {0};
		RCC_OscInitStruct.PLL.PLLState = RCC_PLL_OFF;
		HAL_RCC_OscConfig(&RCC_OscInitStruct);
		printf("\r\nBack running with 16MHz\r\n");
		g_highSpeed = false;
	}
}

void ToggleFlashPrefetch(void) {
	static bool enabled = false;
	if (!enabled) {
		__HAL_FLASH_PREFETCH_BUFFER_ENABLE();
		printf("\r\nPrefetch enabled\r\n");
	} else {
		__HAL_FLASH_PREFETCH_BUFFER_DISABLE();
		printf("\r\nPrefetch disabled\r\n");
	}
	enabled = !enabled;
}

void ToggleFlashCache(void) {
	static bool enabled = false;
	if (!enabled) {
		__HAL_FLASH_INSTRUCTION_CACHE_ENABLE();
		__HAL_FLASH_DATA_CACHE_ENABLE();
		printf("\r\nI+D cache enabled\r\n");
	} else {
		__HAL_FLASH_INSTRUCTION_CACHE_DISABLE();
		__HAL_FLASH_DATA_CACHE_DISABLE();
		printf("\r\nI+D cache disabled\r\n");
	}
	enabled = !enabled;
}

#define BLOCKSIZE_MAX 512

void CheckFlash(void) {
	FlashEnable(128);
	uint16_t status = FlashGetStatus();
	uint16_t density = (status >> 10) & 0xF;
	uint16_t comp = (status >> 14) & 1;
	uint16_t protection = (status >> 9) & 1;
	uint16_t pageSizeB = (status >> 8) & 1;
	uint16_t error = (status >> 5) & 1;
	printf("\r\nFlash status: 0x%04x\r\n  -> density: 0x%x\r\n", status, density);
	printf("  -> compare result: %u\r\n", comp);
	printf("  -> protection: %u\r\n", protection);
	printf("  -> page size: 2^n%s\r\n", pageSizeB ? "" : "+n");
	printf("  -> program/erase error: %u\r\n", error);
	uint8_t manufacturer;
	uint16_t device;
	FlashGetId(&manufacturer, &device);
	printf("Manufacturer: 0x%02x, device: 0x%04x\r\n", manufacturer, device);
	if (manufacturer == 0x1F) {
		printf("  -> From Adesto\r\n");
		uint8_t family = device >> 13;
		if (family == 0x1) {
			printf("  -> AT45D. Looks good\r\n");
			uint8_t density2 = (device >> 8) & 0x1F;
			uint32_t blocksize = FlashBlocksizeGet();
			if (((density2 == 0x7) && (blocksize == 512)) ||
			    ((density2 == 0x8) && (blocksize == 256)))
			{
				uint32_t timestamp = HAL_GetTick();
				uint8_t bufferOut[BLOCKSIZE_MAX] = {0};
				uint8_t bufferIn[BLOCKSIZE_MAX] = {0};
				memcpy(bufferOut, &timestamp, sizeof(uint32_t));
				for (uint32_t i = 4; i < blocksize; i++) {
					bufferOut[i] = i;
				}
				FlashWrite(0, bufferOut, blocksize);
				FlashRead(0, bufferIn, blocksize);
				uint32_t timestamp2 = HAL_GetTick();
				uint32_t delta = timestamp2 - timestamp;
				if (memcmp(bufferOut, bufferIn, blocksize) == 0) {
					printf("Writing and reading back %ubyte successful\r\n", (unsigned int)blocksize);
					printf("Write+Read took %ums\r\n", (unsigned int)delta);
					for (uint32_t i = 128; i >= 2; i /= 2) {
						FlashEnable(i);
						memset(bufferIn, 0, blocksize);
						timestamp = HAL_GetTick();
						FlashRead(0, bufferIn, blocksize);
						timestamp2 = HAL_GetTick();
						delta = timestamp2 - timestamp;
						if (memcmp(bufferOut, bufferIn, blocksize) == 0) {
							printf("Reading with prescaler %u succeed. Time %ums\r\n", (unsigned int)i, (unsigned int)delta);
						} else {
							printf("Reading with prescaler %u failed\r\n", (unsigned int)i);
							break;
						}
					}
				} else {
					printf("Error, read back data mismatched:\r\n");
					PrintHex(bufferIn, blocksize);
					printf("And the sram buffer:\r\n");
					memset(bufferIn, 0, blocksize);
					FlashReadBuffer1(bufferIn, 0, blocksize);
					PrintHex(bufferIn, blocksize);
				}
			} else {
				printf("Error, device ID does not fit to the pagesize\r\n");
			}
		} else {
			printf("Family unknown\r\n");
		}
	} else {
		printf("Manufacturer unknown\r\n");
	}
}

