Solartraveler/UniversalboxArm/src/stm32l452/02-test-everything-hal/testEverything.c
void SetFlashPagesize(void) {
	printf("\r\nEnter p to set the page size to 512byte\r\n");
	char input = 0;
	do {
		input = Rs232GetChar();
		if (input == 'p') {
			printf("Ok...\r\n");
			FlashPagesizePowertwoSet();
			printf("Done\r\n");
		}
	} while (input == 0);
}

void CheckEspPrint(const char * buffer) {
	const uint32_t maxCharsLine = 80;
	uint32_t forceNewline = maxCharsLine;
	while (*buffer) {
		if (isprint(*buffer) || (*buffer == '\r') || (*buffer == '\n')) {
			if (*buffer == '\r') {
				forceNewline = maxCharsLine;
			}
			putchar(*buffer);
			forceNewline--;
		}
		buffer++;
		if (forceNewline == 0) {
			printf("\r\n");
			forceNewline = maxCharsLine;
		}
	}
}

void CheckEsp(void) {
	EspInit();
	char inBuffer[1024] = {0};
	size_t maxBuffer = sizeof(inBuffer);
	printf("\r\n==Enabling Esp==\r\n");
	EspEnable();
	EspCommand("", inBuffer, maxBuffer, 1000);
	CheckEspPrint(inBuffer);
	if ((strstr(inBuffer, "ready")) || (strstr(inBuffer, "Ai-Thinker"))) {

		EspCommand("AT+GMR\r\n", inBuffer, maxBuffer, 250); //request version
		printf("\r\n==Version==\r\n");
		CheckEspPrint(inBuffer);

		EspCommand("AT+CWMODE=?\r\n", inBuffer, maxBuffer, 250); //possible modes?
		printf("\r\n==Supported modes==\r\n");
		CheckEspPrint(inBuffer);

		EspCommand("AT+CWJAP?\r\n", inBuffer, maxBuffer, 250); //current mode?
		printf("\r\n==Current mode==\r\n");
		CheckEspPrint(inBuffer);

		EspCommand("AT+CWMODE_CUR=1\r\n", inBuffer, maxBuffer, 250); //lets become a client
		printf("\r\n==Now a client==\r\n");
		CheckEspPrint(inBuffer);

		//list available AP, dont know the right timeout. 1000 is too less
		EspCommand("AT+CWLAP\r\n", inBuffer, maxBuffer, 7000);
		printf("\r\n==Available APs==\r\n");
		CheckEspPrint(inBuffer);

		EspCommand("AT+CIPSTART=?\r\n", inBuffer, maxBuffer, 1000);
		printf("\r\n==Supported connections==\r\n");
		CheckEspPrint(inBuffer);

	} else {
		printf("Error, no valid answer from ESP detected\r\n");
	}
	EspStop();
	printf("\r\n==Esp disabled==\r\n");
}

void CheckIr(void) {
	IrInit();
	IrOn();
	printf("\r\nIR enabled, signal low will be printed every second until a key is pressed\r\n");
	char input = 0;
	do {
		input = Rs232GetChar();
		uint32_t timeEnd = HAL_GetTick() + 1000;
		float sig = 0;
		float noSig = 0;
		while (HAL_GetTick() < timeEnd) {
			if (IrPinSignal()) {
				sig++;
			} else {
				noSig++;
			}
		}
		if ((sig + noSig) > 1) {
			float perc = sig * 1000.0 / (sig + noSig);
			unsigned int a = perc / 10;
			unsigned int b = perc - a;
			printf("Signal %u.%u%%\r\n", a, b);
		}
	} while (input == 0);
	IrOff();
	printf("Ir disabled\r\n");
}

void SetLcdBacklight(void) {
	static bool state = false;
	state = !state;
	if (state) {
		printf("\r\nBacklight on\r\n");
		LcdBacklightOn();
	} else {
		printf("\r\nBacklight off\r\n");
		LcdBacklightOff();
	}
}

void WriteLcd(void) {
	LcdEnable(4);
	LcdInit(ST7735_128);
	LcdTestpattern();
}

void WriteLcdBig(void) {
	LcdEnable(4);
	LcdInit(ILI9341);
	LcdTestpattern();
}

void WritePixelLcd(void) {
	printf("\r\nEnter 2x3 decimal digits for x+y, then 6 hexadecimal digits for color, separated with a space\r\n");
	char buffer[16] = {0};
	ReadSerialLine(buffer, sizeof(buffer));
	unsigned int x, y, color;
	sscanf(buffer, "%u %u %x", &x, &y, &color);
	PeripheralPrescaler(2);
	LcdWritePixel(x, y, color);
	printf("Written(%u,%u) = 0x%x\r\n", x, y, color);
}

void ManualLcdCmd(void) {
	printf("\r\nFormat (hex): Parameters command data1, data2, data3, data4, data5, data6, data7, data8\r\n");
	char buffer[128];
	ReadSerialLine(buffer, sizeof(buffer));
	printf("\r\n");
	unsigned int vars[10] = {0};
	sscanf(buffer, "%x %x %x %x %x %x %x %x %x %x",
	       vars, vars+1, vars+2, vars+3, vars+4, vars+5, vars+6, vars+7, vars+8, vars+9);
	size_t len = vars[0];
	if (len > 8) {
		return;
	}
	uint8_t parameters[8];
	uint8_t readback[8];
	for (uint32_t i = 0; i < 8; i++) {
		parameters[i] = vars[i+2];
	}
	LcdCommandData(vars[1], parameters, readback, len);
	PrintHex(readback, len);
	printf("Done\r\n");
}

void PeripheralPowercycle(void) {
	printf("\r\nPower off for 4 sec\r\n");
	Rs232Flush();
	PeripheralPowerOff();
	HAL_Delay(2000);
	printf("If you see this message, the power off test failed\r\n");
	HAL_Delay(2000);
	PeripheralPowerOn();
	printf("Power back on. There should be no message printed between this and the power off message\r\n");
}

void CheckCoprocComm(void) {
	printf("\r\nCheck coprocessor communication\r\n");
	uint16_t pattern = CoprocReadTestpattern();
	uint16_t version = CoprocReadVersion();
	uint16_t vcc = CoprocReadVcc();

	printf("Pattern: 0x%x, version: 0x%x, Vcc: %umV\r\n", pattern, version, vcc);
	if (pattern == 0xF055) {
		printf("Looks good\r\n");
	} else {
		printf("Error, pattern does not fit\r\n");
	}
}

void ManualSpiCoprocLevel(void) {
	printf("Enter number 0...3. Low bit will be the clock, high bit will be the data level\r\n");
	char buffer[128];
	ReadSerialLine(buffer, sizeof(buffer));
	printf("\r\n");
	unsigned int val = 0;
	sscanf(buffer, "%x", &val);
	if (val & 2) {
		HAL_GPIO_WritePin(AvrSpiMosi_GPIO_Port, AvrSpiMosi_Pin, GPIO_PIN_SET);
		printf("Data pin now high\r\n");
	} else {
		HAL_GPIO_WritePin(AvrSpiMosi_GPIO_Port, AvrSpiMosi_Pin, GPIO_PIN_RESET);
		printf("Data pin now low\r\n");
	}
	if (val & 1) {
		HAL_GPIO_WritePin(AvrSpiSck_GPIO_Port, AvrSpiSck_Pin, GPIO_PIN_SET);
		printf("Clock pin now high\r\n");
	} else {
		HAL_GPIO_WritePin(AvrSpiSck_GPIO_Port, AvrSpiSck_Pin, GPIO_PIN_RESET);
		printf("Clock pin now low\r\n");
	}
}

void RebootToDfu(void) {
	CoprocWriteReboot(2); //2 for dfu bootloader
}

void RebootToNormal(void) {
	CoprocWriteReboot(1); //1 for normal boot
}

typedef void (ptrFunction_t)(void);

//See https://stm32f4-discovery.net/2017/04/tutorial-jump-system-memory-software-stm32/
void JumpDfu(void) {
	uint32_t dfuStart = 0x1FFF0000;
	Led1Green();
	printf("\r\nDirectly jump to the DFU bootloader\r\n");
	volatile uint32_t * pStackTop = (uint32_t *)dfuStart;
	volatile uint32_t * pProgramStart = (uint32_t *)(dfuStart + 4);
	printf("This function is at 0x%x. New stack will be at 0x%x\r\n", (unsigned int)&JumpDfu, (unsigned int)(*pStackTop));
	printf("Program start will be at 0x%x\r\n", (unsigned int)(*pProgramStart));
	/*The bootloader seems not to reset the GPIO ports, so we can lock the pin for
	  SPI2 MISO and prevent it becoming a high level output
	  but to use our peripherals again, we might need a system reset or at least
	  a GPIO port reset
	*/
	McuLockCriticalPins();

	Led2Off();
	//first all peripheral clocks should be disabled
	UsbStop(); //stops USB clock
	EspStop(); //stops UART3 clock
	AdcStop(); //stops ADC clock
	Rs232Flush();
	PeripheralPowerOff(); //stops SPI2 clock, also RS232 level converter will stop
	Rs232Stop(); //stops UART1 clock
	McuStartOtherProgram((void *)dfuStart, true); //usually does not return
}

void Bogomips(void) {
	uint32_t timeout = HAL_GetTick() + 1000;
	uint32_t ips = 0;
	while (timeout > HAL_GetTick()) {
		ips++;
	}
	printf("\r\nIPS: %u\r\n", (unsigned int)ips);
}

//================== code for USB testing ==============

usbd_device g_usbDev;

